[
  {
    "Headline": "Mineski take down LGD and claim the PGL Open Bucharest title",
    "Body":
      "Mineski claim victory at the PGL Open Bucharest, easily sweeping through LGD Gaming in the Grand Finals.The Grand Finals of PGL Open Bucharest would see Mineski going up against LGD Gaming. The Chinese squad had a wobbly beginning to the tournament but had picked up their game a lot even though they were playing with a stand-in after Chen 'Victoria' Guanhong had a medical condition which meant he had to be replaced. The SEA squad, on the other hand, would be searching for victory and to claim the top spot in the Dota 2 Pro Circuit point rankings – after their withdrawal from the upcoming Dota Pit Minor.",
    "ImageUrl":
      "http://www.gosugamers.net/files/images/news/2017/october/mineski_small1%20top.jpg",
    "Date": " 22 October 2017 18:26",
    "Url":
      "http://www.gosugamers.net/dota2/news/45529-mineski-take-down-lgd-and-claim-the-pgl-open-bucharest-title"
  },

  {
    "Headline":
      "Infamous-P4pita interview: “I knew I had to move from Argentina for shot at a professional career”",
    "Body":
      "For the first time in their few years history, Infamous have dropped the idea of a full Peruvian roster. They qualified to TI 7 with an Argentinian coach -  who now joined the team in the mid lane position.  Mariano 'P4pita' Caneda boasts being the coach of the first ever South American qualified team to The International and is now playing in the first ever Dota 2 minor. He has done that only through hard work and life changing decisions. We got the chance to have a chat with him on the first day of the PGL Open Bucharest minor, and although it was right after a lost series against LGD Gaming, he was extremely happy to share all of his thoughts and talk about his long journey from pub matches to TI7.",
    "ImageUrl":
      "http://www.gosugamers.net/files/images/features/2017/october/papita_small.jpg",
    "Date": "20 October 2017 16:13",
    "Url":
      "http://www.gosugamers.net/dota2/features/45509-infamous-p4pita-interview-i-knew-i-had-to-move-from-argentina-for-shot-at-a-professional-career"
  },
  {
    "Headline":
      "Xboct interview: 'Coaching is something that I really needed to happen in my life'",
    "Body":
      "Alexander 'XBOCT' Dashkevich is an iconic figure for the entire Dota scene. TI 1 champion, three times in a row finalist at the same event, XBOCT was and still is to many youngsters a source of inspiration. Many of the Dota 2 fans know him and remember him for what he accomplished for over five years at Natus Vincere alongside Dendi, Funn1k, Puppey and Kuroky.",
    "ImageUrl":
      "http://www.gosugamers.net/files/images/features/2017/october/xboct%202.jpg",
    "Date": "20 October 2017 14:15",
    "Url":
      "http://www.gosugamers.net/dota2/features/45506-xboct-interview-coaching-is-something-that-i-really-needed-to-happen-in-my-life"
  },
  {
    "Headline":
      "Team Liquid return from the post TI7 vacation to claim the first minor of the season",
    "Body":
      "Undefeated up to the StarLadder i-League Invitational Season 3 grand finals, Team Liquid looked to prove everyone that winning The International is not a curse, but rather just the beginning of the long road to the next Aegis of the Immortals.",
    "ImageUrl":
      "http://www.gosugamers.net/files/images/news/2017/october/Liquid%20SLchamp.jpg",
    "Date": "16 October 2017 00:22",
    "Url":
      "http://www.gosugamers.net/dota2/news/45483-team-liquid-return-from-the-post-ti7-vacation-to-claim-the-first-minor-of-the-season"
  },
  {
    "Headline":
      "[Op-ed] Not here for your viewing pleasure; How ‘esportsmen’ continue to objectify women",
    "Body":
      "It was a case of social media promotion of a newly published article on their website. A failed attempt to highlight the ‘good eye’ these CS:GO players have on and off the screen.",
    "ImageUrl":
      "http://www.gosugamers.net/files/images/features/2017/october/gender.jpg",
    "Date": " 11 October 2017 17:15",
    "Url":
      "http://www.gosugamers.net/dota2/features/45461-op-ed-not-here-for-your-viewing-pleasure-how-esportsmen-continue-to-objectify-women"
  }
]
